pmo-dataset/variations/graphviz_basic/20.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "ParallelGateway_3" -> "Manager submits order ticket to kitchen";
  "ExclusiveGateway_2" -> "ExclusiveGateway_1";
  "Manager takes down the order" -> "ParallelGateway_3";
  "Guest calls room service" -> "Manager takes down the order";
  "ExclusiveGateway_2" -> "Waiter waits/delays debiting";
  "ParallelGateway_3" -> "Manager assigns order to waiter";
  "Manager assigns order to waiter" -> "ParallelGateway_2";
  "ParallelGateway_3" -> "ExclusiveGateway_3";
  "ParallelGateway_2" -> "Waiter prepares nonalcoholic drinks";
  "Waiter debits guest's account" -> "end";
  "Waiter returns to room-service station" -> "ExclusiveGateway_2";
  "Waiter prepares nonalcoholic drinks" -> "ParallelGateway_1";
  "ParallelGateway_2" -> "Waiter readies cart";
  "ExclusiveGateway_1" -> "Waiter debits guest's account";
  "ExclusiveGateway_4" -> "ParallelGateway_1";
  "Kitchen prepares food" -> "ParallelGateway_1";
  "ExclusiveGateway_3" -> "Manager gives order to sommelier";
  "start" -> "Guest calls room service";
  "Waiter delivers order to guest's room" -> "Waiter returns to room-service station";
  "Manager submits order ticket to kitchen" -> "Kitchen prepares food";
  "ParallelGateway_1" -> "Waiter delivers order to guest's room";
  "Sommelier fetches wine and prepare alcoholic beverages" -> "ExclusiveGateway_4";
  "Manager gives order to sommelier" -> "Sommelier fetches wine and prepare alcoholic beverages";
  "Waiter waits/delays debiting" -> "ExclusiveGateway_1";
  "Waiter readies cart" -> "ParallelGateway_1";
  "ExclusiveGateway_3" -> "ExclusiveGateway_4";

  "start" [shape=circle, label="start"];
  "end" [shape=circle, label="end"];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];
  "ParallelGateway_3" [shape=diamond, label="+"];
}
