pmo-dataset/variations/mermaid_with_ids/20.mmd
graph LR
	classDef endEvent stroke-width:3px
	Task_1["Waiter readies cart"]
	Task_2["Kitchen prepares\nfood"]
	Task_3["Sommelier fetches\nwine and prepare\nalcoholic beverages"]
	Task_4["Manager takes down\nthe order"]
	Task_5["Waiter prepares\nnonalcoholic drinks"]
	Task_6["Waiter waits/delays\ndebiting"]
	Task_7["Manager gives order\nto sommelier"]
	Task_8["Waiter debits\nguest's account"]
	Task_9["Manager submits\norder ticket to\nkitchen"]
	Task_10["Waiter returns to\nroom-service station"]
	Task_11["Waiter delivers\norder to guest's\nroom"]
	Task_12["Manager assigns\norder to waiter"]
	Task_13["Guest calls room\nservice"]
	StartNoneEvent_1(("start"))
	EndNoneEvent_1(("end")):::endEvent
	ExclusiveGateway_1{"X"}
	ExclusiveGateway_2{"X"}
	ExclusiveGateway_3{"X"}
	ExclusiveGateway_4{"X"}
	ParallelGateway_1{"+"}
	ParallelGateway_2{"+"}
	ParallelGateway_3{"+"}

	ParallelGateway_3 --> Task_9
	ExclusiveGateway_2 --> ExclusiveGateway_1
	Task_4 --> ParallelGateway_3
	Task_13 --> Task_4
	ExclusiveGateway_2 --> Task_6
	ParallelGateway_3 --> Task_12
	Task_12 --> ParallelGateway_2
	ParallelGateway_3 --> ExclusiveGateway_3
	ParallelGateway_2 --> Task_5
	Task_8 --> EndNoneEvent_1
	Task_10 --> ExclusiveGateway_2
	Task_5 --> ParallelGateway_1
	ParallelGateway_2 --> Task_1
	ExclusiveGateway_1 --> Task_8
	ExclusiveGateway_4 --> ParallelGateway_1
	Task_2 --> ParallelGateway_1
	ExclusiveGateway_3 --> Task_7
	StartNoneEvent_1 --> Task_13
	Task_11 --> Task_10
	Task_9 --> Task_2
	ParallelGateway_1 --> Task_11
	Task_3 --> ExclusiveGateway_4
	Task_7 --> Task_3
	Task_6 --> ExclusiveGateway_1
	Task_1 --> ParallelGateway_1
	ExclusiveGateway_3 --> ExclusiveGateway_4
